In [106]:
import sys
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt
from functools import reduce

### LECTURA DATOS

In [107]:
#mysql_config = {
#    'host': 'localhost',
#    'user': 'root',
#    'database': 'cancer_mama'
#}

#conn_mysql = mysql.connector.connect(**mysql_config)
#cursor_mysql = conn_mysql.cursor()

#query = "SELECT * FROM tumor;"
#df_sql = pd.read_sql_query(query, conn_mysql)

In [108]:
# PARA MAC
# df_sql = pd.read_csv('./Datos/datos_sql.csv')
# df_sql = df_sql.drop('Unnamed: 0',axis=1)
# df_sql

In [109]:
df_csv1 = pd.read_csv('./Datos/patients_batch1.csv')
df_csv2 = pd.read_csv('./Datos/patients_batch2.csv')
df_excel = pd.read_excel('./Datos/gynecological.xlsx')
df_excel = df_excel.drop('Unnamed: 0', axis=1)
df_json = pd.read_json('./Datos/histochemistry.json')
df_sql = pd.read_csv('./Datos/datos_sql.csv')
df_sql = df_sql.drop('Unnamed: 0', axis=1)

# PREPROCESADO

### Preprocesado gynecological

In [110]:
df_excel

,ehr,pregnancy,birth,caesarean,abort,menarche_age,menopause_age
0,10011773,-8.0,0.0,NaN,0.0,NaN,71.0
1,10030299,3.0,NaN,0.0,0.0,NaN,NaN
2,10030824,0.0,0.0,0.0,NaN,NaN,44.0
3,10053435,2.0,NaN,0.0,1.0,21.0,74.0
4,10111454,0.0,-6.0,NaN,0.0,16.0,55.0
...,...,...,...,...,...,...,...
7681,99948591,9.0,2.0,-4.0,0.0,12.0,47.0
7682,99961100,2.0,2.0,0.0,0.0,19.0,52.0
7683,99981192,3.0,3.0,0.0,-5.0,11.0,NaN
7684,99992350,4.0,3.0,NaN,-6.0,11.0,55.0
7685,99994417,2.0,-6.0,NaN,NaN,13.0,NaN

In [111]:
df = df_excel

In [112]:
nulos = df.isnull()

num_nulos_por_columna = nulos.sum()

print("Número de valores nulos por columna:")
print(num_nulos_por_columna)

Número de valores nulos por columna:
ehr                 0
pregnancy        1273
birth            1269
caesarean        1555
abort            1451
menarche_age     2785
menopause_age    3200
dtype: int64

Imputamos los nulos de pregnancy, que es la suma de las otras 3 variables restantes, birth,caesarean y abort.

In [113]:
def imputar_pregnancy(row):
    if pd.isnull(row['pregnancy']):
        return row['birth'] + row['caesarean'] + row['abort']
    else:
        return row['pregnancy']

In [114]:
df['pregnancy'] = df.apply(imputar_pregnancy, axis=1)
df

,ehr,pregnancy,birth,caesarean,abort,menarche_age,menopause_age
0,10011773,-8.0,0.0,NaN,0.0,NaN,71.0
1,10030299,3.0,NaN,0.0,0.0,NaN,NaN
2,10030824,0.0,0.0,0.0,NaN,NaN,44.0
3,10053435,2.0,NaN,0.0,1.0,21.0,74.0
4,10111454,0.0,-6.0,NaN,0.0,16.0,55.0
...,...,...,...,...,...,...,...
7681,99948591,9.0,2.0,-4.0,0.0,12.0,47.0
7682,99961100,2.0,2.0,0.0,0.0,19.0,52.0
7683,99981192,3.0,3.0,0.0,-5.0,11.0,NaN
7684,99992350,4.0,3.0,NaN,-6.0,11.0,55.0
7685,99994417,2.0,-6.0,NaN,NaN,13.0,NaN

In [115]:
nulos = df.isnull()

num_nulos_por_columna = nulos.sum()

print("Número de valores nulos por columna:")
print(num_nulos_por_columna)

Número de valores nulos por columna:
ehr                 0
pregnancy         442
birth            1269
caesarean        1555
abort            1451
menarche_age     2785
menopause_age    3200
dtype: int64

In [116]:
# Imputar valores nulos en la columna "birth"
def imputar_birth(row):
    if pd.isnull(row['birth']):
        return row['pregnancy'] - (row['caesarean'] + row['abort'])
    else:
        return row['birth']

# Aplicar la función a cada fila del DataFrame
df['birth'] = df.apply(imputar_birth, axis=1)

df

,ehr,pregnancy,birth,caesarean,abort,menarche_age,menopause_age
0,10011773,-8.0,0.0,NaN,0.0,NaN,71.0
1,10030299,3.0,3.0,0.0,0.0,NaN,NaN
2,10030824,0.0,0.0,0.0,NaN,NaN,44.0
3,10053435,2.0,1.0,0.0,1.0,21.0,74.0
4,10111454,0.0,-6.0,NaN,0.0,16.0,55.0
...,...,...,...,...,...,...,...
7681,99948591,9.0,2.0,-4.0,0.0,12.0,47.0
7682,99961100,2.0,2.0,0.0,0.0,19.0,52.0
7683,99981192,3.0,3.0,0.0,-5.0,11.0,NaN
7684,99992350,4.0,3.0,NaN,-6.0,11.0,55.0
7685,99994417,2.0,-6.0,NaN,NaN,13.0,NaN

In [117]:
def imputar_caesarean(row):
    if pd.isnull(row['caesarean']):
        return row['pregnancy'] - (row['birth'] + row['abort'])
    else:
        return row['birth']

# Aplicar la función a cada fila del DataFrame
df['caesarean'] = df.apply(imputar_caesarean, axis=1)

df

,ehr,pregnancy,birth,caesarean,abort,menarche_age,menopause_age
0,10011773,-8.0,0.0,-8.0,0.0,NaN,71.0
1,10030299,3.0,3.0,3.0,0.0,NaN,NaN
2,10030824,0.0,0.0,0.0,NaN,NaN,44.0
3,10053435,2.0,1.0,1.0,1.0,21.0,74.0
4,10111454,0.0,-6.0,6.0,0.0,16.0,55.0
...,...,...,...,...,...,...,...
7681,99948591,9.0,2.0,2.0,0.0,12.0,47.0
7682,99961100,2.0,2.0,2.0,0.0,19.0,52.0
7683,99981192,3.0,3.0,3.0,-5.0,11.0,NaN
7684,99992350,4.0,3.0,7.0,-6.0,11.0,55.0
7685,99994417,2.0,-6.0,NaN,NaN,13.0,NaN

In [118]:
def imputar_abort(row):
    if pd.isnull(row['abort']):
        return row['pregnancy'] - (row['caesarean'] + row['birth'])
    else:
        return row['abort']

# Aplicar la función a cada fila del DataFrame
df['abort'] = df.apply(imputar_abort, axis=1)

df

,ehr,pregnancy,birth,caesarean,abort,menarche_age,menopause_age
0,10011773,-8.0,0.0,-8.0,0.0,NaN,71.0
1,10030299,3.0,3.0,3.0,0.0,NaN,NaN
2,10030824,0.0,0.0,0.0,0.0,NaN,44.0
3,10053435,2.0,1.0,1.0,1.0,21.0,74.0
4,10111454,0.0,-6.0,6.0,0.0,16.0,55.0
...,...,...,...,...,...,...,...
7681,99948591,9.0,2.0,2.0,0.0,12.0,47.0
7682,99961100,2.0,2.0,2.0,0.0,19.0,52.0
7683,99981192,3.0,3.0,3.0,-5.0,11.0,NaN
7684,99992350,4.0,3.0,7.0,-6.0,11.0,55.0
7685,99994417,2.0,-6.0,NaN,NaN,13.0,NaN

In [119]:
nulos = df.isnull()

num_nulos_por_columna = nulos.sum()

print("Número de valores nulos por columna:")
print(num_nulos_por_columna)

Número de valores nulos por columna:
ehr                 0
pregnancy         442
birth             447
caesarean         923
abort             670
menarche_age     2785
menopause_age    3200
dtype: int64

In [120]:
# Imputar valores negativos en "pregnancy" basándose en "birth" y "abort"
def imputar_pregnancy_negativo(row):
    if row['pregnancy'] < 0:
        return abs(row['birth'] + row['abort']+row['caesarean'])
    else:
        return row['pregnancy']

# Aplicar la función a cada fila del DataFrame
df['pregnancy'] = df.apply(imputar_pregnancy_negativo, axis=1)

# Mostrar el DataFrame después de la imputación
print("DataFrame después de imputar valores negativos en 'pregnancy':")
df

DataFrame después de imputar valores negativos en 'pregnancy':

,ehr,pregnancy,birth,caesarean,abort,menarche_age,menopause_age
0,10011773,8.0,0.0,-8.0,0.0,NaN,71.0
1,10030299,3.0,3.0,3.0,0.0,NaN,NaN
2,10030824,0.0,0.0,0.0,0.0,NaN,44.0
3,10053435,2.0,1.0,1.0,1.0,21.0,74.0
4,10111454,0.0,-6.0,6.0,0.0,16.0,55.0
...,...,...,...,...,...,...,...
7681,99948591,9.0,2.0,2.0,0.0,12.0,47.0
7682,99961100,2.0,2.0,2.0,0.0,19.0,52.0
7683,99981192,3.0,3.0,3.0,-5.0,11.0,NaN
7684,99992350,4.0,3.0,7.0,-6.0,11.0,55.0
7685,99994417,2.0,-6.0,NaN,NaN,13.0,NaN

### Preprocesado patients_batch1/patients_batch2

Para el preprocesado vamos a comenzar uniendo los dataframes de origen csv, ya que comparten las mismas columnas. Para poder realizar el preprocesado de ambos de una manera más sencilla

In [121]:
df_csv = pd.merge(df_csv1, df_csv2, on=['ehr','birth_date','diagnosis_date','death_date'], how='outer')
df_csv

            ehr  birth_date diagnosis_date death_date
0      10011773  1959-07-05     2015-04-02        NaN
1      10020495  1953-10-02     2017-12-04        NaN
2      10030299  1966-08-16     2019-06-27        NaN
3      10030824  1953-03-03     2018-09-07        NaN
4      10041592  1959-07-06     2018-11-19        NaN
...         ...         ...            ...        ...
10495  99966287  16/12/1978     02/08/2018        NaN
10496  99981192  10/04/1949     28/10/2017        NaN
10497  99988958  21/01/1966     27/05/2013        NaN
10498  99992350  04/09/1939     17/12/2018        NaN
10499  99994417  10/02/1962     01/04/2017        NaN

[10500 rows x 4 columns]

In [122]:
df_csv.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 10500 entries, 0 to 10499
Data columns (total 4 columns):
 #   Column          Non-Null Count  Dtype
---  ------          --------------  -----
 0   ehr             10500 non-null  int64
 1   birth_date      10500 non-null  object
 2   diagnosis_date  10500 non-null  object
 3   death_date      1184 non-null   object
dtypes: int64(1), object(3)
memory usage: 410.2+ KB

Observamos que en nuestro dataset de csv tenemos variables de tipo int64 y object; El identificador del paciente tendrá valor numérico, luego el resto de variables (birth_date, diagnosis_date, death_date) con formato de objeto.

Tambien podemos observar gracaias a la columna Non-Null Count, que de las variables birth_date y diagnosis_date no tenemos ningun valor nulo (ya que tenemos 10500 valores no nulos). Sin embargo, en la columna death_date si que tenemos nulos que calcularemos más adelante

Primero vamos a pasar las fechas a tipo 'datetime'. Y una vez que los tenemos en este tipo, ponemos todas las fechas en el mismo formato

In [123]:
# Convertir las columnas objeto al formato datetime
df_csv['birth_date'] = pd.to_datetime(df_csv['birth_date'])
df_csv['diagnosis_date'] = pd.to_datetime(df_csv['diagnosis_date'])
df_csv['death_date'] = pd.to_datetime(df_csv['death_date'])

# Cambiamos los formatos a '%d/%m/%Y'
df_csv['birth_date'] = df_csv['birth_date'].dt.strftime('%d-%m-%Y')
df_csv['diagnosis_date'] = df_csv['diagnosis_date'].dt.strftime('%d-%m-%Y')
df_csv['death_date'] = df_csv['death_date'].dt.strftime('%d-%m-%Y')

df_csv

            ehr  birth_date diagnosis_date death_date
0      10011773  05-07-1959     02-04-2015        NaN
1      10020495  02-10-1953     04-12-2017        NaN
2      10030299  16-08-1966     27-06-2019        NaN
3      10030824  03-03-1953     07-09-2018        NaN
4      10041592  06-07-1959     19-11-2018        NaN
...         ...         ...            ...        ...
10495  99966287  16-12-1978     08-02-2018        NaN
10496  99981192  04-10-1949     28-10-2017        NaN
10497  99988958  21-01-1966     27-05-2013        NaN
10498  99992350  09-04-1939     17-12-2018        NaN
10499  99994417  02-10-1962     04-01-2017        NaN

[10500 rows x 4 columns]

Como podemos apreciar a primera vista, y hemos observado antes,  la columna de death_date posee muchos nulos. Vamos a realizar un recuento de valores para esa columna para ver cuantos pacientes han fallecido de nuestro conjunto de datos

In [124]:
valores = df_csv['death_date'].count()
valores

1184

In [125]:
valores = df_csv['death_date'].isnull().sum()
valores

9316

Vemos que  hay 1184 pacientes que han fallecido, y 9316 pacientes estables.

Obseramos ahora si tenemos algún identificador duplicado, lo que significaría que tendríamos dos entradas del mismo paciente

In [126]:
df_csv['ehr'].duplicated().any()

True

Como nos devuelve True, tenemos al menos un identificador duplicado, vamos a imprimir cuantos

In [135]:
valores_duplicados = df_csv['ehr'].duplicated() # Función booleana
duplicados = df_csv[valores_duplicados]

# Pasamos los identificadores duplicados a formato lista para poder visualizarlos mejor
lista_duplicados = duplicados['ehr'].tolist()

# Imprimimos los valores duplicados, y cuantas veces aparecen duplicados
for i in lista_duplicados:
    conteo_duplicados = df_csv['ehr'].value_counts()[i]
    print(f"Valor: {i}, Contador: {conteo_duplicados}")

Valor: 72992494, Contador: 2
Valor: 73002338, Contador: 2
Valor: 73008149, Contador: 2
Valor: 73012939, Contador: 2
Valor: 73019870, Contador: 2
Valor: 73023533, Contador: 2
Valor: 73028729, Contador: 2
Valor: 73032048, Contador: 2
Valor: 73044771, Contador: 2
Valor: 73058633, Contador: 2
Valor: 73065270, Contador: 2
Valor: 73066125, Contador: 2
Valor: 73082648, Contador: 2
Valor: 73084641, Contador: 2
Valor: 73086658, Contador: 2
Valor: 73095852, Contador: 2
Valor: 73096542, Contador: 2
Valor: 73102549, Contador: 2
Valor: 73104918, Contador: 2
Valor: 73111704, Contador: 2
Valor: 73116349, Contador: 2
Valor: 73129838, Contador: 2
Valor: 73163695, Contador: 2
Valor: 73166702, Contador: 2
Valor: 73182879, Contador: 2
Valor: 73186443, Contador: 2
Valor: 73197959, Contador: 2
Valor: 73210647, Contador: 2
Valor: 73216753, Contador: 2
Valor: 73221718, Contador: 2
Valor: 73229306, Contador: 2
Valor: 73281640, Contador: 2
Valor: 73282540, Contador: 2
Valor: 73294146, Contador: 2
Valor: 73307445, Contador: 2
Valor: 73317936, Contador: 2
Valor: 73328288, Contador: 2
Valor: 73329007, Contador: 2
Valor: 73336329, Contador: 2
Valor: 73340672, Contador: 2
Valor: 73347288, Contador: 2
Valor: 73349987, Contador: 2
Valor: 73355256, Contador: 2
Valor: 73358968, Contador: 2
Valor: 73392911, Contador: 2
Valor: 73394172, Contador: 2
Valor: 73394975, Contador: 2
Valor: 73397086, Contador: 2
Valor: 73399071, Contador: 2
Valor: 73402972, Contador: 2
Valor: 73423716, Contador: 2
Valor: 73427564, Contador: 2
Valor: 73459124, Contador: 2
Valor: 73467639, Contador: 2
Valor: 73483313, Contador: 2
Valor: 73486574, Contador: 2
Valor: 73490358, Contador: 2
Valor: 73491774, Contador: 2
Valor: 73498194, Contador: 2
Valor: 73499435, Contador: 2
Valor: 73503403, Contador: 2
Valor: 73508926, Contador: 2
Valor: 73520665, Contador: 2
Valor: 73529703, Contador: 2
Valor: 73537843, Contador: 2
Valor: 73554200, Contador: 2
Valor: 73561333, Contador: 2
Valor: 73566569, Contador: 2
Valor: 73566651, Contador: 2
Valor: 73569793, Contador: 2
Valor: 73581014, Contador: 2
Valor: 73584310, Contador: 2
Valor: 73586823, Contador: 2
Valor: 73590168, Contador: 2
Valor: 73592374, Contador: 2
Valor: 73593596, Contador: 2
Valor: 73596129, Contador: 2
Valor: 73623925, Contador: 2
Valor: 73631826, Contador: 2
Valor: 73635288, Contador: 2
Valor: 73653745, Contador: 2
Valor: 73655877, Contador: 2
Valor: 73657421, Contador: 2
Valor: 73666548, Contador: 2
Valor: 73667158, Contador: 2
Valor: 73702573, Contador: 2
Valor: 73705072, Contador: 2
Valor: 73726353, Contador: 2
Valor: 73748499, Contador: 2
Valor: 73754849, Contador: 2
Valor: 73757178, Contador: 2
Valor: 73778847, Contador: 2
Valor: 73797870, Contador: 2
Valor: 73809129, Contador: 2
Valor: 73809773, Contador: 2
Valor: 73814165, Contador: 2
Valor: 73830365, Contador: 2
Valor: 73840930, Contador: 2
Valor: 73848501, Contador: 2
Valor: 73849146, Contador: 2
Valor: 73859091, Contador: 2
Valor: 73882654, Contador: 2
Valor: 73898453, Contador: 2
Valor: 73907566, Contador: 2
Valor: 73926174, Contador: 2
Valor: 73928161, Contador: 2
Valor: 73938029, Contador: 2
Valor: 73958785, Contador: 2
Valor: 73961236, Contador: 2
Valor: 73961349, Contador: 2
Valor: 73962534, Contador: 2
Valor: 73974646, Contador: 2
Valor: 73974985, Contador: 2
Valor: 73985348, Contador: 2
Valor: 73991312, Contador: 2
Valor: 74004548, Contador: 2
Valor: 74013717, Contador: 2
Valor: 74022476, Contador: 2
Valor: 74031110, Contador: 2
Valor: 74056410, Contador: 2
Valor: 74063301, Contador: 2
Valor: 74071833, Contador: 2
Valor: 74081794, Contador: 2
Valor: 74086475, Contador: 2
Valor: 74087043, Contador: 2
Valor: 74114233, Contador: 2
Valor: 74123324, Contador: 2
Valor: 74131434, Contador: 2
Valor: 74151547, Contador: 2
Valor: 74153326, Contador: 2
Valor: 74155529, Contador: 2
Valor: 74170060, Contador: 2
Valor: 74178325, Contador: 2
Valor: 74192035, Contador: 2
Valor: 74195158, Contador: 2
Valor: 74195215, Contador: 2
Valor: 74195293, Contador: 2
Valor: 74202936, Contador: 2
Valor: 74205730, Contador: 2
Valor: 74205924, Contador: 2
Valor: 74213068, Contador: 2
Valor: 74226015, Contador: 2
Valor: 74238863, Contador: 2
Valor: 74248046, Contador: 2
Valor: 74259554, Contador: 2
Valor: 74260738, Contador: 2
Valor: 74263304, Contador: 2
Valor: 74266894, Contador: 2
Valor: 74268005, Contador: 2
Valor: 74313879, Contador: 2
Valor: 74328319, Contador: 2
Valor: 74330049, Contador: 2
Valor: 74332070, Contador: 2
Valor: 74336855, Contador: 2
Valor: 74336979, Contador: 2
Valor: 74351730, Contador: 2
Valor: 74354911, Contador: 2
Valor: 74363162, Contador: 2
Valor: 74367163, Contador: 2
Valor: 74368354, Contador: 2
Valor: 74368884, Contador: 2
Valor: 74388058, Contador: 2
Valor: 74389998, Contador: 2
Valor: 74390811, Contador: 2
Valor: 74424344, Contador: 2
Valor: 74433329, Contador: 2
Valor: 74445104, Contador: 2
Valor: 74456744, Contador: 2
Valor: 74484795, Contador: 2
Valor: 74492302, Contador: 2
Valor: 74495858, Contador: 2
Valor: 74507724, Contador: 2
Valor: 74518286, Contador: 2
Valor: 74539252, Contador: 2
Valor: 74540240, Contador: 2
Valor: 74548137, Contador: 2
Valor: 74565577, Contador: 2
Valor: 74566689, Contador: 2
Valor: 74588504, Contador: 2
Valor: 74601439, Contador: 2
Valor: 74602222, Contador: 2
Valor: 74616410, Contador: 2
Valor: 74617052, Contador: 2
Valor: 74617738, Contador: 2
Valor: 74629850, Contador: 2
Valor: 74640432, Contador: 2
Valor: 74651512, Contador: 2
Valor: 74668959, Contador: 2
Valor: 74671167, Contador: 2
Valor: 74674867, Contador: 2
Valor: 74675863, Contador: 2
Valor: 74680654, Contador: 2
Valor: 74684698, Contador: 2
Valor: 74695578, Contador: 2
Valor: 74698716, Contador: 2
Valor: 74699722, Contador: 2
Valor: 74722448, Contador: 2
Valor: 74722991, Contador: 2
Valor: 74726442, Contador: 2
Valor: 74740930, Contador: 2
Valor: 74743936, Contador: 2
Valor: 74750849, Contador: 2
Valor: 74758153, Contador: 2
Valor: 74771846, Contador: 2
Valor: 74774840, Contador: 2
Valor: 74776280, Contador: 2
Valor: 74785721, Contador: 2
Valor: 74810592, Contador: 2
Valor: 74819052, Contador: 2
Valor: 74827211, Contador: 2
Valor: 74837658, Contador: 2
Valor: 74846449, Contador: 2
Valor: 74847329, Contador: 2
Valor: 74847752, Contador: 2
Valor: 74851054, Contador: 2
Valor: 74859238, Contador: 2
Valor: 74859663, Contador: 2
Valor: 74867968, Contador: 2
Valor: 74868870, Contador: 2
Valor: 74874271, Contador: 2
Valor: 74883005, Contador: 2
Valor: 74889270, Contador: 2
Valor: 74894381, Contador: 2
Valor: 74896410, Contador: 2
Valor: 74902548, Contador: 2
Valor: 74904213, Contador: 2
Valor: 74905670, Contador: 2
Valor: 74908231, Contador: 2
Valor: 74912023, Contador: 2
Valor: 74912497, Contador: 2
Valor: 74916668, Contador: 2
Valor: 74920187, Contador: 2
Valor: 74925827, Contador: 2
Valor: 74927923, Contador: 2
Valor: 74929395, Contador: 2
Valor: 74957202, Contador: 2
Valor: 74958934, Contador: 2
Valor: 74967494, Contador: 2
Valor: 74973124, Contador: 2
Valor: 74999908, Contador: 2
Valor: 75046726, Contador: 2
Valor: 75049191, Contador: 2
Valor: 75053714, Contador: 2
Valor: 75078212, Contador: 2
Valor: 75093194, Contador: 2
Valor: 75099293, Contador: 2
Valor: 75103297, Contador: 2
Valor: 75124682, Contador: 2
Valor: 75128398, Contador: 2
Valor: 75147755, Contador: 2
Valor: 75155506, Contador: 2
Valor: 75155627, Contador: 2
Valor: 75159745, Contador: 2
Valor: 75185867, Contador: 2
Valor: 75205844, Contador: 2
Valor: 75211398, Contador: 2
Valor: 75226697, Contador: 2
Valor: 75232672, Contador: 2
Valor: 75234851, Contador: 2
Valor: 75237174, Contador: 2
Valor: 75248255, Contador: 2
Valor: 75259028, Contador: 2
Valor: 75263445, Contador: 2
Valor: 75263996, Contador: 2
Valor: 75266631, Contador: 2
Valor: 75283840, Contador: 2
Valor: 75299992, Contador: 2
Valor: 75303252, Contador: 2
Valor: 75307171, Contador: 2
Valor: 75307928, Contador: 2
Valor: 75311059, Contador: 2
Valor: 75316533, Contador: 2
Valor: 75320953, Contador: 2
Valor: 75347737, Contador: 2
Valor: 75359021, Contador: 2
Valor: 75391384, Contador: 2
Valor: 75403486, Contador: 2
Valor: 75426158, Contador: 2
Valor: 75431467, Contador: 2
Valor: 75452196, Contador: 2
Valor: 75467155, Contador: 2
Valor: 75471869, Contador: 2
Valor: 75471995, Contador: 2
Valor: 75484242, Contador: 2
Valor: 75515028, Contador: 2
Valor: 75517783, Contador: 2
Valor: 75527573, Contador: 2
Valor: 75533142, Contador: 2
Valor: 75543660, Contador: 2
Valor: 75553663, Contador: 2
Valor: 75560296, Contador: 2
Valor: 75582457, Contador: 2
Valor: 75583232, Contador: 2
Valor: 75583481, Contador: 2
Valor: 75586195, Contador: 2
Valor: 75619813, Contador: 2
Valor: 75622588, Contador: 2
Valor: 75627306, Contador: 2
Valor: 75634685, Contador: 2
Valor: 75657760, Contador: 2
Valor: 75676938, Contador: 2
Valor: 75692192, Contador: 2
Valor: 75695722, Contador: 2
Valor: 75706860, Contador: 2
Valor: 75708523, Contador: 2
Valor: 75718543, Contador: 2
Valor: 75721881, Contador: 2
Valor: 75722126, Contador: 2
Valor: 75733827, Contador: 2
Valor: 75756984, Contador: 2
Valor: 75781270, Contador: 2
Valor: 75782551, Contador: 2
Valor: 75786961, Contador: 2
Valor: 75812698, Contador: 2
Valor: 75821388, Contador: 2
Valor: 75821595, Contador: 2
Valor: 75828025, Contador: 2
Valor: 75828835, Contador: 2
Valor: 75830283, Contador: 2
Valor: 75844691, Contador: 2
Valor: 75846130, Contador: 2
Valor: 75847765, Contador: 2
Valor: 75852229, Contador: 2
Valor: 75856450, Contador: 2
Valor: 75860655, Contador: 2
Valor: 75875530, Contador: 2
Valor: 75901077, Contador: 2
Valor: 75903512, Contador: 2
Valor: 75907012, Contador: 2
Valor: 75925413, Contador: 2
Valor: 75932107, Contador: 2
Valor: 75938638, Contador: 2
Valor: 75940981, Contador: 2
Valor: 75941266, Contador: 2
Valor: 75946696, Contador: 2
Valor: 75959462, Contador: 2
Valor: 75977968, Contador: 2
Valor: 75996586, Contador: 2
Valor: 76009619, Contador: 2
Valor: 76018031, Contador: 2
Valor: 76061742, Contador: 2
Valor: 76062754, Contador: 2
Valor: 76065647, Contador: 2
Valor: 76067689, Contador: 2
Valor: 76069436, Contador: 2
Valor: 76088574, Contador: 2
Valor: 76099155, Contador: 2
Valor: 76102187, Contador: 2
Valor: 76114942, Contador: 2
Valor: 76124021, Contador: 2
Valor: 76124595, Contador: 2
Valor: 76131267, Contador: 2
Valor: 76154854, Contador: 2
Valor: 76174558, Contador: 2
Valor: 76197754, Contador: 2
Valor: 76202208, Contador: 2
Valor: 76206869, Contador: 2
Valor: 76214537, Contador: 2
Valor: 76217577, Contador: 2
Valor: 76238731, Contador: 2
Valor: 76252772, Contador: 2
Valor: 76253010, Contador: 2
Valor: 76254126, Contador: 2
Valor: 76272269, Contador: 2
Valor: 76298788, Contador: 2
Valor: 76313966, Contador: 2
Valor: 76337865, Contador: 2
Valor: 76366521, Contador: 2
Valor: 76374730, Contador: 2
Valor: 76375783, Contador: 2
Valor: 76380318, Contador: 2
Valor: 76380540, Contador: 2
Valor: 76401162, Contador: 2
Valor: 76407641, Contador: 2
Valor: 76447223, Contador: 2
Valor: 76465347, Contador: 2
Valor: 76484747, Contador: 2
Valor: 76488091, Contador: 2
Valor: 76489508, Contador: 2
Valor: 76493403, Contador: 2
Valor: 76532863, Contador: 2
Valor: 76563122, Contador: 2
Valor: 76578682, Contador: 2
Valor: 76597004, Contador: 2
Valor: 76600110, Contador: 2
Valor: 76637007, Contador: 2
Valor: 76653499, Contador: 2
Valor: 76664414, Contador: 2
Valor: 76677775, Contador: 2
Valor: 76682894, Contador: 2
Valor: 76705091, Contador: 2
Valor: 76708043, Contador: 2
Valor: 76721149, Contador: 2
Valor: 76726461, Contador: 2
Valor: 76744401, Contador: 2
Valor: 76748088, Contador: 2
Valor: 76751197, Contador: 2
Valor: 76762031, Contador: 2
Valor: 76766230, Contador: 2
Valor: 76771402, Contador: 2
Valor: 76773074, Contador: 2
Valor: 76781791, Contador: 2
Valor: 76791882, Contador: 2
Valor: 76792260, Contador: 2
Valor: 76799363, Contador: 2
Valor: 76805239, Contador: 2
Valor: 76808556, Contador: 2
Valor: 76827705, Contador: 2
Valor: 76841552, Contador: 2
Valor: 76855340, Contador: 2
Valor: 76865088, Contador: 2
Valor: 76872175, Contador: 2
Valor: 76875487, Contador: 2
Valor: 76883849, Contador: 2
Valor: 76895408, Contador: 2
Valor: 76898362, Contador: 2
Valor: 76900706, Contador: 2
Valor: 76908042, Contador: 2
Valor: 76922324, Contador: 2
Valor: 76922686, Contador: 2
Valor: 76926707, Contador: 2
Valor: 76948898, Contador: 2
Valor: 76951020, Contador: 2
Valor: 76967180, Contador: 2
Valor: 76969986, Contador: 2
Valor: 76973389, Contador: 2
Valor: 76977837, Contador: 2
Valor: 76984095, Contador: 2
Valor: 76988367, Contador: 2
Valor: 76989058, Contador: 2
Valor: 76998431, Contador: 2
Valor: 77000811, Contador: 2
Valor: 77021737, Contador: 2
Valor: 77032588, Contador: 2
Valor: 77032996, Contador: 2
Valor: 77043859, Contador: 2
Valor: 77052257, Contador: 2
Valor: 77061552, Contador: 2
Valor: 77070692, Contador: 2
Valor: 77094198, Contador: 2
Valor: 77097450, Contador: 2
Valor: 77111131, Contador: 2
Valor: 77113022, Contador: 2
Valor: 77113064, Contador: 2
Valor: 77140424, Contador: 2
Valor: 77141149, Contador: 2
Valor: 77144914, Contador: 2
Valor: 77147647, Contador: 2
Valor: 77154059, Contador: 2
Valor: 77172322, Contador: 2
Valor: 77178348, Contador: 2
Valor: 77191155, Contador: 2
Valor: 77196162, Contador: 2
Valor: 77199913, Contador: 2
Valor: 77205663, Contador: 2
Valor: 77213492, Contador: 2
Valor: 77219710, Contador: 2
Valor: 77232312, Contador: 2
Valor: 77235438, Contador: 2
Valor: 77235727, Contador: 2
Valor: 77235846, Contador: 2
Valor: 77239377, Contador: 2
Valor: 77250820, Contador: 2
Valor: 77266999, Contador: 2
Valor: 77268737, Contador: 2
Valor: 77280871, Contador: 2
Valor: 77285015, Contador: 2
Valor: 77287307, Contador: 2
Valor: 77287928, Contador: 2
Valor: 77300022, Contador: 2
Valor: 77308444, Contador: 2
Valor: 77311364, Contador: 2
Valor: 77349887, Contador: 2
Valor: 77355597, Contador: 2
Valor: 77362227, Contador: 2
Valor: 77373286, Contador: 2
Valor: 77391524, Contador: 2
Valor: 77402516, Contador: 2
Valor: 77419087, Contador: 2
Valor: 77424865, Contador: 2
Valor: 77431462, Contador: 2
Valor: 77438292, Contador: 2
Valor: 77442788, Contador: 2
Valor: 77446728, Contador: 2
Valor: 77467172, Contador: 2
Valor: 77475078, Contador: 2
Valor: 77504189, Contador: 2
Valor: 77504873, Contador: 2
Valor: 77509127, Contador: 2
Valor: 77513078, Contador: 2
Valor: 77529472, Contador: 2
Valor: 77536934, Contador: 2
Valor: 77538259, Contador: 2
Valor: 77539952, Contador: 2
Valor: 77563788, Contador: 2
Valor: 77575810, Contador: 2
Valor: 77578551, Contador: 2
Valor: 77579212, Contador: 2
Valor: 77605742, Contador: 2
Valor: 77606485, Contador: 2

In [141]:
fila_especificas = df_csv[df_csv['ehr'] == 77575810]
fila_especificas

           ehr  birth_date diagnosis_date death_date
7495  77575810  21-03-1958     22-02-2014        NaN
7995  77575810  21-03-1958     22-02-2014        NaN

In [136]:
#df.drop_duplicates(subset='columna_a_verificar', keep='first', inplace=True)

Una vez que tenemos todos los pacientes correctamente, vamos a comprobar que las fechas de los pacientes entran en los rangos correctos:
- Dia: [1:31]
- Mes: [1:12]

Empezamos comprobando que el rango de los días es el correcto:

In [ ]:
columnas = ['birth_date', 'diagnosis_date', 'death_date']

for i in columnas:
    # Especifico el rango
    rango_días = (
        pd.to_datetime(df_csv[i], format='%d-%m-%Y', errors='coerce').dt.day < 1
        | (pd.to_datetime(df_csv[i], format='%d-%m-%Y', errors='coerce').dt.day > 31)
    )

    filas_fuera_de_rango = df_csv[rango_días]

    if not filas_fuera_de_rango.empty:
        print(f"Filas con días fuera del rango en {i}:")
        print(filas_fuera_de_rango)
    else:
        print(f"Todos los días en {i} están dentro del rango.")

Todos los días en birth_date están dentro del rango.
Todos los días en diagnosis_date están dentro del rango.
Todos los días en death_date están dentro del rango.

Comprobamos ahora el rango de los meses:

In [ ]:
columnas = ['birth_date', 'diagnosis_date', 'death_date']

for i in columnas:
    # Especifico el rango
    rango_mes = (
        pd.to_datetime(df_csv[i], format='%d-%m-%Y', errors='coerce').dt.month < 1
        | (pd.to_datetime(df_csv[i], format='%d-%m-%Y', errors='coerce').dt.month > 12)
    )

    filas_fuera_de_rango = df_csv[rango_mes]

    if not filas_fuera_de_rango.empty:
        print(f"Filas con días fuera del rango en {i}:")
        print(filas_fuera_de_rango)
    else:
        print(f"Todos los días en {i} están dentro del rango.")

Todos los días en birth_date están dentro del rango.
Todos los días en diagnosis_date están dentro del rango.
Todos los días en death_date están dentro del rango.

Por lo tanto, podemos concluir que tenemos todos los datos en el mismo formato, y con los valores correctos. Es decir, no tenemos ninguna fecha mal puesta

### Preprocesado histochemistry

In [ ]:
df_json

           ehr   er  her2  ki67   pr
0     10011773  0.0   0.0  19.0  NaN
1     10020495  1.0   0.0   9.0  0.0
2     10030299  1.0   NaN  18.0  1.0
3     10030824  1.0   0.0   NaN  1.0
4     10041592  0.0   0.0  65.0  0.0
...        ...  ...   ...   ...  ...
9995  99966287  1.0   0.0   NaN  0.0
9996  99981192  1.0   0.0  14.0  0.0
9997  99988958  NaN   0.0  67.0  NaN
9998  99992350  0.0   0.0  16.0  0.0
9999  99994417  1.0   0.0  20.0  1.0

[10000 rows x 5 columns]

Lo pasamos a formato csv para poder estudiar los datos más facilmente

In [ ]:
df_json.to_csv('datos_json.csv',)
df_json

           ehr   er  her2  ki67   pr
0     10011773  0.0   0.0  19.0  NaN
1     10020495  1.0   0.0   9.0  0.0
2     10030299  1.0   NaN  18.0  1.0
3     10030824  1.0   0.0   NaN  1.0
4     10041592  0.0   0.0  65.0  0.0
...        ...  ...   ...   ...  ...
9995  99966287  1.0   0.0   NaN  0.0
9996  99981192  1.0   0.0  14.0  0.0
9997  99988958  NaN   0.0  67.0  NaN
9998  99992350  0.0   0.0  16.0  0.0
9999  99994417  1.0   0.0  20.0  1.0

[10000 rows x 5 columns]

In [ ]:
df_json.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 10000 entries, 0 to 9999
Data columns (total 5 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   ehr     10000 non-null  int64
 1   er      9042 non-null   float64
 2   her2    9006 non-null   float64
 3   ki67    9032 non-null   float64
 4   pr      9018 non-null   float64
dtypes: float64(4), int64(1)
memory usage: 390.8 KB

Observamos que tenemos todos los datos de tipo numérico. El identificador del paciente (ehr) de tipo int, y el resto de variables como float

Mostramos ahora cuantos nulos hay por columna

In [ ]:
nulos = df_json.isnull()

num_nulos_por_columna = nulos.sum()

print("Número de valores nulos por columna:")
print(num_nulos_por_columna)

Número de valores nulos por columna:
ehr       0
er      958
her2    994
ki67    968
pr      982
dtype: int64

Tenemos varios valores

### Preprocesado datos_sql.csv

In [ ]:
df_sql.to_csv('datos_sql.csv',)

In [ ]:
df_sql.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 11167 entries, 0 to 11166
Data columns (total 14 columns):
 #   Column                   Non-Null Count  Dtype
---  ------                   --------------  -----
 0   ehr                      11167 non-null  int64
 1   n_tumor                  11167 non-null  int64
 2   t_category               11167 non-null  object
 3   n_category               11167 non-null  int64
 4   m_category               11167 non-null  int64
 5   t_category_after_neoadj  5677 non-null   object
 6   n_category_after_neoadj  5677 non-null   float64
 7   m_category_after_neoadj  5627 non-null   float64
 8   stage_diagnosis          11167 non-null  object
 9   stage_after_neo          6064 non-null   object
 10  grade                    11167 non-null  int64
 11  ductal                   6324 non-null   float64
 12  lobular                  1564 non-null   float64
 13  neoadjuvant              11167 non-null  object
dtypes: float64(4), int64(5), object(5)
memory usage: 1.2+ MB